/*
===============================================================================================================================
               ULTIMAS ATUALIZAÇÕES EFETUADAS - CONSULTAR LOG DO VERSIONADOR PARA HISTORICO COMPLETO
===============================================================================================================================
   Autor      |   Data   |                              Motivo                                                          
-------------------------------------------------------------------------------------------------------------------------------
Alex Wallauer |28/03/2025| Chamado 49970. Correção do nome do Ponto de entrada para CM010LEG
===============================================================================================================================
*/

#Include "TOTVS.ch"

/*
==============================================================================================================================================================
Programa----------: CM010LEG
Autor-------------: Alex Wallauer Ferreira
Data da Criacao---: 29/07/2024
Descrição---------: PE para criar legenda do Cadastro de tabela de preço dentro da 
                    função Com010Leg()/COMA010.PRX. Andre. Chamado: 47732 
Parametros--------: ParamIXB[1]
Retorno-----------: aLegenda
==============================================================================================================================================================
*/
User Function CM010LEG()

Local aLegenda:=ParamIXB[1]

aAdd(aLegenda,{"BR_AZUL","Aguardando Aprovação"})

Return aLegenda
