#Include "TOTVS.ch"

/*
===============================================================================================================================
Programa----------: OM040TOK
Autor-------------: Erich Buttner
Data da Criacao---: 01/08/13
===============================================================================================================================
Descrição---------: Ponto de entrada ao confirmar o Cadastro de Motorista
===============================================================================================================================
Uso---------------: Cadastro de Motoristas - OMS. Chamado 3809
===============================================================================================================================
Parametros--------: Nenhum
===============================================================================================================================
Retorno-----------: lRet - .T. ou .F.
===============================================================================================================================
Usuario-----------:
===============================================================================================================================
Setor-------------: Setor do usuário solicitante
===============================================================================================================================
                                    ATUALIZACOES SOFRIDAS DESDE A CONSTRUÇAO INICIAL
===============================================================================================================================
       Autor      |    Data    |                              Motivo                       |        Usuario         |  Setor  |
-------------------------------------------------------------------------------------------------------------------------------
 Lucas Crevilari  | 12/12/2014 | Incluído verificação das Classes C e G, alterado o        | 000391-LUCASC          | TI-SP   |
    			  |			   | Help, exclusão da pergunta se deseja prosseguir.		   |						|		  |	
===============================================================================================================================
*/

User Function OM040TOK()

Local _cForn 	:= Upper(SubStr(M->DA4_FORNEC,1,1))
Local lRet 		:= .T.
Local aInfHelp	:= {}

If Inclui .Or. Altera
	If _cForn $ "T;A;C;G" 
		lRet := .T.
	Else // Se Classe do motorista não é T, A, C ou G.
		aAdd( aInfHelp	, { "Fornecedor selecionado não pertence à  "	, "classe 'T','A','G' ou 'C'.          "	, ""	} ) // Descricao do Help
		aAdd( aInfHelp	, { "Verifique o Fornecedor informado.      "	, ""										, ""	} ) // Solucao
		
		U_ITCADHLP( aInfHelp , "ITOMFOR01" ) //Cadastra o Help
		Help( "" , 1 , "ITOMFOR01" ) //Exibe o Help
		
		lRet := .F.		
	EndIf
EndIf	

Return lRet
